Revit 2026 API

# ElementIsHidden Method

---

Identifies if the element has been permanently hidden in the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsHidden(
	View pView
)
```
```vb
Public Function IsHidden (
	pView As View
) As Boolean
```
```cpp
public:
bool IsHidden(
	View^ pView
)
```
```fsharp
member IsHidden :
        pView : View -> bool
```

#### Parameters

pView View

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |

This does not determine if the element is hidden as a result of temporary hide/isolate, view sectioning, view crop box, or other operations that can cause elements not to be visible. To hide or unhide an element, use the Hide() and Unhide() method of View.

#### Reference

Element Class

Autodesk.Revit.DB Namespace